In [2]:
import numpy as np
import pandas as pd

In [8]:
# data with missing values
test_data = {"Name":["Manish", "Ram", "Sita", "Gita", None],
              "Salary":[98000, 99000,np.nan, 50000, 60000],
              "Age": [20, 22, 23, 21, np.nan],
              }

df = pd.DataFrame(test_data)
df

     Name   Salary   Age
0  Manish  98000.0  20.0
1     Ram  99000.0  22.0
2    Sita      NaN  23.0
3    Gita  50000.0  21.0
4    None  60000.0   NaN

In [9]:
# drop the nan(undefined or missing) data rows
df_clean = df.dropna()
df_clean

     Name   Salary   Age
0  Manish  98000.0  20.0
1     Ram  99000.0  22.0
3    Gita  50000.0  21.0

In [10]:
# fill the nan values
df_filled = df.fillna(
    {
        "Name": "Unknown",
        "Salary": df["Salary"].median(),
        "Age": df["Age"].mean()
    }
)
df_filled

      Name   Salary   Age
0   Manish  98000.0  20.0
1      Ram  99000.0  22.0
2     Sita  79000.0  23.0
3     Gita  50000.0  21.0
4  Unknown  60000.0  21.5